# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

number = int(input('Введите трехзначное число: '))
s = number // 100
d = number // 10 % 10
e = number % 10
print(s + d + e)